Тест_ЗУП_31_КОРП/src/InformationRegisters/НастройкиПодбораПерсонала/НастройкиПодбораПерсонала.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПодбораПерсонала</name>
  <resources>
    <name>ИспользоватьПодборПерсонала</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОткрытиеВакансииТребуетСогласования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьПоискКандидатовНаИнтернетСайтах</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьОценкуЭффективностиИсточниковИнформацииОКандидатах</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
</mdclass:InformationRegister>

Тест_ЗУП_31_КОРП/src/InformationRegisters/НастройкиПодбораПерсонала/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет первоначальное заполнение
//
Процедура НачальноеЗаполнение() Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК Поле1
	|ИЗ
	|	РегистрСведений.НастройкиПодбораПерсонала КАК НастройкиПодбораПерсонала
	|ГДЕ
	|	НастройкиПодбораПерсонала.ИспользоватьПодборПерсонала
	|	И НЕ НастройкиПодбораПерсонала.ИспользоватьОценкуЭффективностиИсточниковИнформацииОКандидатах");
	
	Если Запрос.Выполнить().Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.НастройкиПодбораПерсонала.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		НаборЗаписей[0].ИспользоватьОценкуЭффективностиИсточниковИнформацииОКандидатах = Истина;
		НаборЗаписей.Записать();
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
